chat_system_460900476_actor_description=Frogus Bogis. Mutant Frogman.
chat_system_460900476_snap_3_question=^?^Thank you for your help. It has become more peaceful since you hoisted the flag over my house. Can I help you?
chat_system_460900476_snap_3_answer_0=^?^Of course. Show me your shop.
chat_system_460900476_switch_0_header_0=^?^Hello, kind traveler. I welcome you to my modest dwelling. I am Frogus Bogis. Who are you? 
chat_system_460900476_snap_0_question=^?^1
chat_system_460900476_snap_0_answer_0=^?^I am [player]. I have never seen frogmen. This is amazing! And do you have a store? 
chat_system_460900476_snap_6_question=^?^No, sorry, I sell nothing. 
chat_system_460900476_snap_6_answer_0=^?^That's too bad. Well, goodbye then.
chat_system_460900476_snap_1_question=^?^1
chat_system_460900476_snap_1_answer_0=^?^I am [player]. Are you related to those Froguses who live at the swamp?
chat_system_460900476_snap_4_question=^?^Yes, I am Squelch's and Bagaba's younger brother. 
chat_system_460900476_snap_4_answer_0=^?^I see. You look so much alike.
chat_system_460900476_snap_2_question=^?^1
chat_system_460900476_snap_2_answer_0=^?^I am [player]. You must be Bagaba's and Squelch's younger brother?
chat_system_460900476_snap_5_question=^?^Yes, that's right. Have you met them already?
chat_system_460900476_snap_5_answer_0=^?^Yes, I have...
chat_system_460900476_snap_3_answer_7=^?^Do you need any Dragonfly Eggs?
chat_system_460900476_snap_3_answer_8=^?^About the eggs...
chat_system_460900476_snap_16_question=^?^Dragonfly Eggs? Certainly! On occasion I travel to Arlania to try and collect eggs, but it is very dangerous for me.
chat_system_460900476_snap_16_answer_0=^?^So what would you like to trade for them?
chat_system_460900476_snap_17_question=^?^I do have this stash of Magic Crystals! You won't believe what you find in the swamps around here or sometimes I go to the crypts and find some crystals there as well. I think a fair trade would be 125 Dragonfly Eggs for 1 Magic Crystal. What do you say?
chat_system_460900476_snap_17_answer_0=^?^Hmmm... That sounds like a fair deal to me! Let me go get some eggs...
chat_system_460900476_snap_17_answer_1=^?^I like it! I already have some eggs on me! Let's trade...
chat_system_460900476_snap_18_question=^?^Would you like to trade your Dragonfly Eggs?
chat_system_460900476_snap_18_answer_0=^?^I just wanted to double check the exchange rate...
chat_system_460900476_snap_18_answer_1=^?^I have some, but I don't have enough.
chat_system_460900476_snap_18_answer_2=^?^[img_crystal] Receive 1 Magic Crystal for 125 Dragonfly Eggs.
chat_system_460900476_snap_18_answer_3=^?^[img_crystal] Receive 2 Magic Crystals for 250 Dragonfly Eggs.
chat_system_460900476_snap_18_answer_4=^?^[img_crystal] Receive 5 Magic Crystals for 625 Dragonfly Eggs.
chat_system_460900476_snap_18_answer_5=^?^[img_crystal] Receive 10 Magic Crystals for 1250 Dragonfly Eggs.
chat_system_460900476_snap_18_answer_6=^?^You know, I've changed my mind - show me your shop...
chat_system_460900476_snap_18_answer_7=^?^You know, I've changed my mind - I've gotta go...
chat_system_460900476_snap_19_question=^?^I'm sure you'll find some more... Don't forget, you need at least 125 eggs to trade!
chat_system_460900476_snap_19_answer_0=^?^You're right, let me go look for some more...
chat_system_460900476_snap_20_question=^?^Here is your Magic Crystal. Thank you for the eggs!
chat_system_460900476_snap_20_answer_0=^?^Let's get back to trading...
chat_system_460900476_snap_20_answer_1=^?^I gotta go...
chat_system_460900476_snap_21_question=^?^Here are your Magic Crystals. So many eggs!
chat_system_460900476_snap_21_answer_0=^?^Let's get back to trading...
chat_system_460900476_snap_21_answer_1=^?^I gotta go...
chat_system_460900476_snap_22_question=^?^You should find some in Arlania near the river... Don't forget, you need at least 125 eggs to trade!
chat_system_460900476_snap_22_answer_0=^?^Sounds good to me, I'll look for some when I'm there...